INSERT INTO client (Full_Name, Passport, Phone_Number) VALUES
	('Жук Иван Иванович', 'НВ7563498', '80447224536'),                                                             
	('Герасимова Галина Павловна', 'HB4567234', '80445446789'),
	('Тесёлкин Олег Олегович', 'HB7634784', '80293243645'),
	('Самураева Анна Сергеевна', 'HB3456998', '80293457856'),																		
	('Иванов Фёдор Фёдорович', 'HB2355678', '80447644568'),
	('Медведев Михаил Потапович', 'HB2355667', '80291243256'),															  
	('Джигитов Сосо Иосифович', 'HB2345423', '80447893345');															  															  


INSERT INTO manager (Full_Name) VALUES 
    ('Банкиров Дмитрий Эдуардович'),          
    ('Стольникова Анна Альбертовна'),
    ('Самусенко Анатолий Валерьевич'),
    ('Карпов Николай Иванович'),
    ('Кутузова Александра Михайловна'); 


INSERT INTO contract (Client, Manager, Date_Of_Contract) VALUES
    ('1', '101', '2016-01-01'),
	('2', '104', '2016-01-01'),
	('3', '103', '2017-11-06'),
	('4', '102', '2017-11-11'),
	('5', '103', '2016-09-11'),
	('6', '105', '2018-09-17'),
	('7', '102', '2017-05-07');


INSERT INTO account (Ballance, Contract) VALUES
	('0', '1000001'),
	('1200.56', '1000002'),
	('567.99', '1000003'),
	('4578.5', '1000004'),
	('135', '1000005'),
	('2000.78', '1000006'),
	('0', '1000007');


INSERT INTO operation_type (Amount, Operation_Type, Account) VALUES 
	('1000', 'Пополнение', '10001'),
	('2100', 'Пополнение', '10003'),
	('25', 'Снятие', '10004'),
	('75', 'Перевод', '10002'),
	('65.90', 'Оплата', '10005'),
	('45.87', 'Оплата', '10001'),
	('35.67', 'Оплата', '10007'),
	('15', 'Снятие', '10006'),
	('10', 'Перевод', '10004'),
	('100', 'Пополнение', '10003'),
	('900', 'Пополнение', '10001'),
	('95.87', 'Оплата', '10001'),
	('34.67', 'Оплата', '10007'),
	('25', 'Снятие', '10006'),
	('1000', 'Пополнение', '10001'),
	('2100', 'Пополнение', '10003'),
	('25', 'Снятие', '10004'),
	('75', 'Перевод', '10002'),
	('65.90', 'Оплата', '10005'),
	('45.87', 'Оплата', '10001'),
	('35.67', 'Оплата', '10007'),
	('15', 'Снятие', '10006'),
	('10', 'Перевод', '10004'),
	('100', 'Пополнение', '10003'),
	('900', 'Пополнение', '10001'),
	('95.87', 'Оплата', '10001'),
	('34.67', 'Оплата', '10007'),
	('25', 'Снятие', '10006'),
	('5', 'Снятие', '10007'),
	('5', 'Снятие', '10007');
